## Day 10 : Hands on Pandas Part-2

**REFERENCE:** https://medium.datadriveninvestor.com/day-10-60-days-of-data-science-and-machine-learning-d5d789fbda79

### Indexing DataFrames

Indexing means to selecting all/particular rows and columns of data from a DataFrame. 
- In pandas it can be done using three constructs:

    - .loc() : Pure label/location based
        - loc is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.

    It has methods like scalar label, list of labels, slice object etc

    - .iloc() : Pure Interger based
        - iloc is integer index-based. So here, we have to specify rows and columns by their integer index.

    - .ix() : Both integer and location based (Hybrid)

Pandas provides a hybrid method for selections and subsetting the object using the ix[] operator. ix[] is the most general indexer and will support any of the inputs in .loc[] and .iloc[].

In [1]:
### Implementation

import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(4, 3), index = ['a','b','c','d'], columns = ['X', 'Y', 'Z'])
df

          X         Y         Z
a  2.163978 -1.301283  0.305670
b -0.491556 -2.203509 -0.825675
c -0.793785  0.092440 -0.405986
d -0.016624 -2.852862 -0.238352

In [2]:
print (df.loc['c'] > 0)

X    False
Y     True
Z    False
Name: c, dtype: bool

In [3]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['X', 'Y', 'Z', 'A'])
df

          X         Y         Z         A
0  0.161712  0.357174 -0.629400 -0.658356
1 -1.287094 -1.101245 -0.209627 -0.161742
2  0.775622 -0.384072  0.170408  0.609491
3 -1.183515 -1.356152  0.479670 -0.697540
4 -0.957366  0.602192 -1.287738  0.561580
5  0.546978  0.845421 -1.907404  0.465117
6 -0.203800 -0.776661 -0.624894  0.905769
7  1.081647 -0.964316 -0.508707  0.947710

In [4]:
# Slicing through list of values
print(df.iloc[[1, 2, 3], [1, 3]])

          Y         A
1 -1.101245 -0.161742
2 -0.384072  0.609491
3 -1.356152 -0.697540

### Slicing DataFrames

In order to slice by labels you can use loc() attribute of the DataFrame.

In [5]:
df.loc[1:4, :]

          X         Y         Z         A
1 -1.287094 -1.101245 -0.209627 -0.161742
2  0.775622 -0.384072  0.170408  0.609491
3 -1.183515 -1.356152  0.479670 -0.697540
4 -0.957366  0.602192 -1.287738  0.561580

In [6]:
df.loc[:, "X":"Z"]

          X         Y         Z
0  0.161712  0.357174 -0.629400
1 -1.287094 -1.101245 -0.209627
2  0.775622 -0.384072  0.170408
3 -1.183515 -1.356152  0.479670
4 -0.957366  0.602192 -1.287738
5  0.546978  0.845421 -1.907404
6 -0.203800 -0.776661 -0.624894
7  1.081647 -0.964316 -0.508707

### Filtering DataFrames

Using Filter you can subset rows or columns of dataframe according to labels in the specified index of the data.

In [7]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"], "Department":["IT","Human Resources","Finance","Supply Chain"], 
                            "Income":[4800,5200,6600,5700], "Age":[24,28,33,41]})
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [8]:
### Filtering with Filter () Function.

employees.filter(items=["Department","Name","Income"])

        Department    Name  Income
0               IT    Josh    4800
1  Human Resources    Mike    5200
2          Finance   Julia    6600
3     Supply Chain  Sergio    5700

### Transforming DataFrames

Pandas Transform helps in creating a DataFrame with transformed values and has the same axis length as its own.

> Syntax: df.transform(function, axis=0, *args, **kwargs) where

    function — Function for transforming the data
    axis : 0 for rows and 1 for column
    *args : Positional arguments
    **kwargs : Keyword arguments

In [9]:
df = pd.DataFrame({"x":[120, 40, 3, None, None,34], "y":[17, 12, None, 23, None,56], 
                   "z":[200, 216, 101, None, 8,78], "a":[114, 31, None, 12, 63,32]}) 
df

       x     y      z      a
0  120.0  17.0  200.0  114.0
1   40.0  12.0  216.0   31.0
2    3.0   NaN  101.0    NaN
3    NaN  23.0    NaN   12.0
4    NaN   NaN    8.0   63.0
5   34.0  56.0   78.0   32.0

In [10]:
index_ = ['R1', 'R2', 'R3', 'R4', 'R5','R6']
df.index = index_
df

        x     y      z      a
R1  120.0  17.0  200.0  114.0
R2   40.0  12.0  216.0   31.0
R3    3.0   NaN  101.0    NaN
R4    NaN  23.0    NaN   12.0
R5    NaN   NaN    8.0   63.0
R6   34.0  56.0   78.0   32.0

In [11]:
res = df.transform(func = ['log', 'exp'])
res

           x                       y                       z                \
         log           exp       log           exp       log           exp
R1  4.787492  1.304181e+52  2.833213  2.415495e+07  5.298317  7.225974e+86
R2  3.688879  2.353853e+17  2.484907  1.627548e+05  5.375278  6.421080e+93
R3  1.098612  2.008554e+01       NaN           NaN  4.615121  7.307060e+43
R4       NaN           NaN  3.135494  9.744803e+09       NaN           NaN
R5       NaN           NaN       NaN           NaN  2.079442  2.980958e+03
R6  3.526361  5.834617e+14  4.025352  2.091659e+24  4.356709  7.498417e+33

           a
         log           exp
R1  4.736198  3.232741e+49
R2  3.433987  2.904885e+13
R3       NaN           NaN
R4  2.484907  1.627548e+05
R5  4.143135  2.293783e+27
R6  3.465736  7.896296e+13

### Adding Rows — append()

- append() method is used to add a new row to the end of the DataFrame.
- The method takes a single argument which is a dictionary of the values to be added.
- The method returns a new DataFrame with the added row.

In [12]:
employees.append({"Name":"Romeo"}, ignore_index=True)

     Name       Department  Income   Age
0    Josh               IT  4800.0  24.0
1    Mike  Human Resources  5200.0  28.0
2   Julia          Finance  6600.0  33.0
3  Sergio     Supply Chain  5700.0  41.0
4   Romeo              NaN     NaN   NaN

### Hierarchical indexing

Hierarchical indexing is the technique in which we set more than one column name as the index. set_index() function is used for when doing hierarchical indexing.

**REFERENCE:** https://pandas.pydata.org/docs/user_guide/advanced.html

In [13]:
index = pd.MultiIndex.from_product([[2020, 2021], [3, 4]], names=['Year', 'Round'])
columns = pd.MultiIndex.from_product([['Claire', 'Kassi', 'Suer'], ['English', 'Maths']], names=['Name', 'Subject'])

In [14]:
data = np.round(np.random.randn(4, 6), 1)
data[:, ::3] *= 5
data += 19

In [15]:
df = pd.DataFrame(data, index=index, columns=columns)
df

Name        Claire         Kassi          Suer
Subject    English Maths English Maths English Maths
Year Round
2020 3        17.0  21.1    19.4  23.5    19.0  19.4
     4        19.0  19.6    18.3  16.5    18.9  18.9
2021 3        16.0  20.1    19.2  25.5    18.6  18.2
     4        18.0  17.3    20.0  22.0    19.7  18.0

### Merging DataFrames

Concat() Function is used to merge the dataframes.

In [16]:
employee_db1 = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"], "Department":["IT","Human Resources","Finance","Supply Chain"], 
                            "Income":[4800,5200,6600,5700], "Age":[24,28,33,41]})
employee_db1

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [17]:
employees_db2 = pd.DataFrame({"Name":["Berkay","Michael","Christy","Feder"], "Department":["Finance","Marketing","Human Resources","Law"],
                                "Income":[5700,6900,8700,6300], "Age":[29,33,29,44]})
employees_db2

      Name       Department  Income  Age
0   Berkay          Finance    5700   29
1  Michael        Marketing    6900   33
2  Christy  Human Resources    8700   29
3    Feder              Law    6300   44

Merge using concat

In [18]:
pd.concat([employee_db1, employees_db2])

      Name       Department  Income  Age
0     Josh               IT    4800   24
1     Mike  Human Resources    5200   28
2    Julia          Finance    6600   33
3   Sergio     Supply Chain    5700   41
0   Berkay          Finance    5700   29
1  Michael        Marketing    6900   33
2  Christy  Human Resources    8700   29
3    Feder              Law    6300   44

#### Joins

It helps us merging DataFrames. Types of Joins —
- **Inner Join :-** Returns records that have matching values in both tables.
- **Left Join :-** Returns all the rows from the left table that are specified in the left outer join clause, not just the rows in which the columns match.
- **Right Join :-** Returns all records from the right table, and the matched records from the left table.
- **Full Join :-** Returns all records when there is a match in either left or right table.
- **Cross Join :-** Returns all possible combinations of rows from two tables.

In [19]:
c1 = pd.DataFrame({"Name":['Amy','Allen','Alice','Anderson','Amanda'], "Age":[21,22,26,29,32], "Roll Number":[12,19,29,10,8]})
c2 =pd.DataFrame({"Marks":[90,89,82,98,85], "Roll Number":[1,90,29,48,67]})

In [20]:
### INNER JOIN

pd.concat([c1,c2], join= "inner")

   Roll Number
0           12
1           19
2           29
3           10
4            8
0            1
1           90
2           29
3           48
4           67

In [21]:
### FULL OUTER JOIN

pd.concat([c1,c2], join = "outer", ignore_index=True)

       Name   Age  Roll Number  Marks
0       Amy  21.0           12    NaN
1     Allen  22.0           19    NaN
2     Alice  26.0           29    NaN
3  Anderson  29.0           10    NaN
4    Amanda  32.0            8    NaN
5       NaN   NaN            1   90.0
6       NaN   NaN           90   89.0
7       NaN   NaN           29   82.0
8       NaN   NaN           48   98.0
9       NaN   NaN           67   85.0

In [22]:
### LEFT JOIN

pd.merge(c1,c2, how= "left")

       Name  Age  Roll Number  Marks
0       Amy   21           12    NaN
1     Allen   22           19    NaN
2     Alice   26           29   82.0
3  Anderson   29           10    NaN
4    Amanda   32            8    NaN

In [23]:
### RIGHT JOIN

pd.merge(c1,c2, how= "right")

    Name   Age  Roll Number  Marks
0    NaN   NaN            1     90
1    NaN   NaN           90     89
2  Alice  26.0           29     82
3    NaN   NaN           48     98
4    NaN   NaN           67     85

### Pivot Tables

It creates a Spreadsheet style pivot table as a DataFrame.

In [24]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [25]:
employees.pivot_table("Income", index = "Department", columns = "Name")

Name               Josh   Julia    Mike  Sergio
Department
Finance             NaN  6600.0     NaN     NaN
Human Resources     NaN     NaN  5200.0     NaN
IT               4800.0     NaN     NaN     NaN
Supply Chain        NaN     NaN     NaN  5700.0

### Aggregate Functions

Pandas has a number of aggregating functions that reduce the dimension of the grouped object.
- count()
- value_count()
- mean()
- median()
- sum()
- min()
- max()
- std()
- var()
- describe()
- sem()

In [26]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio","Julia","Michael","Sarath","Jakub","Chris"],
                        "Department":["IT","Human Resources","Finance","Supply Chain","Finance","Marketing","IT","Human Resources","Law"],
                        "Income":[4800,5200,6600,5700,7200,8400,7700,4200,9400], "Age":[24,28,33,41,22,46,31,27,39],
                        "Experience":[2,5,9,17,1,24,10,6,13]})

employees

      Name       Department  Income  Age  Experience
0     Josh               IT    4800   24           2
1     Mike  Human Resources    5200   28           5
2    Julia          Finance    6600   33           9
3   Sergio     Supply Chain    5700   41          17
4    Julia          Finance    7200   22           1
5  Michael        Marketing    8400   46          24
6   Sarath               IT    7700   31          10
7    Jakub  Human Resources    4200   27           6
8    Chris              Law    9400   39          13

In [27]:
employees.count()               #### It count elements by elements.

Name          9
Department    9
Income        9
Age           9
Experience    9
dtype: int64

In [28]:
employees["Department"].value_counts()          #### It counts value in column

IT                 2
Human Resources    2
Finance            2
Supply Chain       1
Marketing          1
Law                1
Name: Department, dtype: int64

In [29]:
employees.mean()                #### Compute Mean of each column if it's numeric.

/var/folders/k3/yy8qff1s4sj0k71g9rcc339w8gvs2x/T/ipykernel_64021/958202530.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.mean()                #### Compute Mean of each column if it's numeric.

Income        6577.777778
Age             32.333333
Experience       9.666667
dtype: float64

In [30]:
employees["Income"].mean()              #### Compute mean of specfic Column.

6577.777777777777

In [31]:
employees.median()                  #### We can also compute median of Numeric Values

/var/folders/k3/yy8qff1s4sj0k71g9rcc339w8gvs2x/T/ipykernel_64021/2705991600.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.median()                  #### We can also compute median of Numeric Values

Income        6600.0
Age             31.0
Experience       9.0
dtype: float64

In [32]:
employees["Income"].sum()               #### Computing the sum of a specific Column.

59200

In [33]:
employees.min()             #### Compute minimum value of each Column.

Name            Chris
Department    Finance
Income           4200
Age                22
Experience          1
dtype: object

In [34]:
employees["Age"].max()                  #### Find the max Age

46

In [35]:
employees.std()             #### Compute Std Deviation of each column.

/var/folders/k3/yy8qff1s4sj0k71g9rcc339w8gvs2x/T/ipykernel_64021/1664226856.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.std()             #### Compute Std Deviation of each column.

Income        1746.981524
Age              8.154753
Experience       7.416198
dtype: float64

In [36]:
employees.var()                     #### Computing the Varience.

/var/folders/k3/yy8qff1s4sj0k71g9rcc339w8gvs2x/T/ipykernel_64021/3226736670.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  employees.var()                     #### Computing the Varience.

Income        3.051944e+06
Age           6.650000e+01
Experience    5.500000e+01
dtype: float64